package com.example.rent_a_car_app.data

class TeslaCarsList {

    companion object {
        val teslaCarsList = mutableListOf(
            TeslaCars(
                "Tesla Roadster",
                80,
                "Спортивный электромобиль, первый автомобиль фирмы. Официальная презентация состоялась 19 июля 2006 года в городе Санта-Моника, Калифорния.\n" +
                        "\n" +
                        "Tesla Motors провела конкурс для выбора вида запланированных двух Tesla Roadster, выданных британским производителем спортивных автомобилей Lotus. Автомобили были получены.\n" +
                        "\n" +
                        "Первые 1000 Tesla Roadster были сделаны в течение одного месяца. Цена одного автомобиля составила 100 000 долларов США. Серийное производство началось в марте 2008 года.\n" +
                        "\n" +
                        "Эта модель продавалась до 2012 года, поскольку контракт с Lotus на поставку 2500 машин истёк в конце 2011 года. Компания перестала принимать заявки на американском рынке в августе 2011 года[43]. Следующее поколение этой модели планировалось представить в 2019 году.",
                "https://upload.wikimedia.org/wikipedia/commons/1/12/Tesla_Roadster_electric_car_DSC_0160.jpg"),
            TeslaCars(
                "Tesla Roadster",
                80,
                "Спортивный электромобиль, первый автомобиль фирмы. Официальная презентация состоялась 19 июля 2006 года в городе Санта-Моника, Калифорния.\n" +
                        "\n" +
                        "Tesla Motors провела конкурс для выбора вида запланированных двух Tesla Roadster, выданных британским производителем спортивных автомобилей Lotus. Автомобили были получены.\n" +
                        "\n" +
                        "Первые 1000 Tesla Roadster были сделаны в течение одного месяца. Цена одного автомобиля составила 100 000 долларов США. Серийное производство началось в марте 2008 года.\n" +
                        "\n" +
                        "Эта модель продавалась до 2012 года, поскольку контракт с Lotus на поставку 2500 машин истёк в конце 2011 года. Компания перестала принимать заявки на американском рынке в августе 2011 года[43]. Следующее поколение этой модели планировалось представить в 2019 году.",
                "https://upload.wikimedia.org/wikipedia/commons/1/12/Tesla_Roadster_electric_car_DSC_0160.jpg"),
            TeslaCars(
                "Tesla Model S",
                100,
                "Концепт автомобиля был представлен 26 марта 2009 года в городке Хоторн, Калифорния. Пятидверный хетчбэк разрабатывается под прежним условным обозначением «Whitestar» фирменным филиалом в Детройте. После окончания проектно-конструкторских работ фабрика должна производить в Калифорнии первоначально 10 000, позже — 25 000 автомобилей модели.\n" +
                        "\n" +
                        "Поставка автомобилей в США началась 22 июня 2012 года[44]. Изначально предлагалось две версии: на 60 и 85 кВт⋅ч, оборудованные одним электродвигателем, расположенным на задней оси. Затем, 9 октября 2014 года, появилась опция с электродвигателями на каждой оси, а уже с 8 апреля 2015 года компания полностью отказалась от однодвигательной комплектации и от 60 кВт⋅ч версии. С этого времени все выпускающиеся машины оборудованы двумя электродвигателями, полным приводом и в базовой версии оснащаются 70 кВт⋅ч батареей. Стартовая цена начинается от 75 750 долларов в США. В зависимости от комплектации, без перезарядки автомобиль сможет проехать 442, 502 и 480 километров[45].\n" +
                        "\n" +
                        "12 ноября 2012 года автомобиль получил награду «Автомобиль года» от американского журнала Motor Trend[46].\n" +
                        "\n" +
                        "Поставки моделей S и X в 2015 и 2016 годах[47][48]:\n" +
                        "\n" +
                        "30 марта 2018 года компания Tesla отозвала около 123 тыс. автомобилей серии Model S, которые были выпущены до апреля 2016, для замены деталей гидроусилителя руля. Обуславливалось это тем, что болты гидроусилителя подвержены коррозии в холодное время года. Такое воздействие оказывается из-за соли, которую используют в целях предотвращения обледенения на дорогах[49].",
                "https://upload.wikimedia.org/wikipedia/commons/2/2f/Tesla_Model_S_Signature.png"),
            TeslaCars(
                "Tesla Model X",
                120,
                "9 февраля 2012 года компания представила прототип новой модели — кроссовер под названием Tesla Model X. Тогда же Илон Маск заявил, что производство модели планируется начать в 2013 году[50]. Изначально планировалось, что в конце 2014 года будут поставлены небольшие партии, а полноценный выпуск модели начнётся в 2015 году[51]. Однако в феврале 2014 года было заявлено, что начало поставок ожидается только во втором квартале 2015 года[52]. В ноябре начало поставок было вновь перенесено, на этот раз на третий квартал 2015 года[53].\n" +
                        "\n" +
                        "По сравнению с Model S внесены следующие изменения: добавлен 3-й ряд сидений, автоматически открывающиеся задние двери вверх для входа пассажиров во 2-й и 3-й ряд, возможность заказать модель с двумя моторами.\n" +
                        "\n" +
                        "В 1-м квартале 2016 года было продано 2400 Tesla Model X[54].",
                "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Tesla_Model_X_in_Pacific_Place.jpg/1280px-Tesla_Model_X_in_Pacific_Place.jpg"
            ),
            TeslaCars(
                "Model 3",
                100,
                "Model 3 изначально носила названия Model E и BlueStar, текущее название было анонсировано 15 июля 2014 года[55]. Ожидалось, что модель будет представлена в марте 2016 года[56].\n" +
                        "\n" +
                        "30 июля 2007 года Мартин Эберхард сообщил, что автомобиль поступит в продажу к 2012 году. Ожидаемая цена модели в США составляла не более 30 000 долларов[источник не указан 1881 день].\n" +
                        "\n" +
                        "Model 3 была представлена 1 апреля 2016 года. За первую неделю машину зарезервировали 325 тыс. человек, внеся депозит в одну тысячу долларов. По словам Маска, такой значительный объём заказов должен был привести к корректировке производственных планов компании[57].\n" +
                        "\n" +
                        "Производство стартовало в 2017 году. Цена стандартной версии — 35 000 долларов, дальность поездки в базовой модели равна 350 км[56][58]. Автомобиль на 20 % компактнее Model S[58].",
                "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Tesla_Model_3_parked%2C_front_driver_side.jpg/1280px-Tesla_Model_3_parked%2C_front_driver_side.jpg"
            ),
            TeslaCars(
                "Model Y",
                115,
                "Электрический кроссовер среднего класса, представленный в марте 2019 года[59]. Серийное производство начато на фабрике во Фримонте[en] в январе 2020[60], а поставки потребителям — 13 марта 2020[61]",
                "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Tesla_Model_Y_front_passenger_side_view.jpg/1280px-Tesla_Model_Y_front_passenger_side_view.jpg"
            ),
            TeslaCars(
                "Tesla Cybertruck",
                650,
                "21 ноября 2019 года компания представила электрический пикап Tesla Cybertruck. Спустя пять дней после презентации автомобиль собрал 250 000 предзаказов[62].\n" +
                        "\n" +
                        "Обладает запасом хода на 400—800 км, а также пневмоподвеской, подстраивающейся под нагрузку. Есть опция герметичности и розетки в кузове на 110 и 220 вольт[63].\n" +
                        "\n" +
                        "Производство было запланировано на конец 2022 года. 20 июля 2022 года Илон Маск сообщил, что производство Cybertruck начнётся летом 2023 года[64].",
                "https://upload.wikimedia.org/wikipedia/commons/0/0c/Tesla_Cybertruck_outside_unveil_modified_by_Smnt.jpg"
            ),
            TeslaCars(
                "Tesla Semi",
                1920,
                "16 ноября 2017 Tesla провела презентацию электрического тягача Tesla Semi, производство которого начнется в 2023 году[65]. Запас хода у электрогрузовика составляет примерно 800 км (возможно 900 км) при загрузке в 40 тонн[66].\n" +
                        "\n" +
                        "Хотя иногда автомобиль называют первым в мире представителем класса электрогрузовиков[67], он был представлен позже MFTBC E-Fuso Vision One[68].",
                "https://upload.wikimedia.org/wikipedia/commons/3/35/Tesla_Semi_5.jpg"
            ),
            TeslaCars(
                "Tesla Roadster 2",
                220,
                "Второе поколение электромобиля Tesla Roadster анонсированное в ноябре 2017 года. Среди основных характеристик автомобиля были заявлены: максимальная скорость — свыше 400 км/ч, время разгона с 0 до 96.5 км/ч — 1,9 секунды, максимальный пробег на одной зарядке — до 1000 км[69]. Старт серийного производства ожидается в 2022 году[70].",
                "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Tesla_Roadster_2.0_%2847619421652%29.jpg/1280px-Tesla_Roadster_2.0_%2847619421652%29.jpg"
            )
        )
    }
}